Revit 2027 API
NurbSpline.Degree Property
Returns the degree of the nurb spline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Degree { get; }
Public ReadOnly Property Degree As Integer
	Get
public:
property int Degree {
	int get ();
}
member Degree : int with get
Property Value
Int32
See Also
Reference
NurbSpline Class
Autodesk.Revit.DB Namespace